The output of the operation is longer than the comment limit in Github, please look at the full plan in the action run:
https://github.com/ministryofjustice/dso-azure-automation-accounts/actions/runs/1876430777
Output from Terraform plan
```[command]/home/runner/work/_temp/a4634f1e-352d-4078-8825-c37a81f81292/terraform-bin plan -refresh=false -no-color -out=plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.automation_account["nomis-bip-t1"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account/runbooks/start-vms"
      ~ log_verbose             = true -> false
        name                    = "start-vms"
        tags                    = {
            "application"      = "BI"
            "environment_name" = "T1"
            "service"          = "NOMIS"
        }
        # (7 unchanged attributes hidden)
    }

  # module.automation_account["nomis-bip-t1"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account/runbooks/stop-vms"
      ~ log_verbose             = true -> false
        name                    = "stop-vms"
        tags                    = {
            "application"      = "BI"
            "environment_name" = "T1"
            "service"          = "NOMIS"
        }
        # (7 unchanged attributes hidden)
    }

  # module.automation_account["nomis-bip-t1"].azurerm_log_analytics_workspace.analytics_workspace will be created
  + resource "azurerm_log_analytics_workspace" "analytics_workspace" {
      + daily_quota_gb             = -1
      + id                         = (known after apply)
      + internet_ingestion_enabled = true
      + internet_query_enabled     = true
      + location                   = "ukwest"
      + name                       = "nomis-bip-t1-automation-account"
      + portal_url                 = (known after apply)
      + primary_shared_key         = (sensitive value)
      + resource_group_name        = "nomis-bip-t1"
      + retention_in_days          = 30
      + secondary_shared_key       = (sensitive value)
      + sku                        = "PerGB2018"
      + tags                       = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        }
      + workspace_id               = (known after apply)
    }

  # module.automation_account["nomis-bip-t1"].azurerm_monitor_action_group.email_dso will be created
  + resource "azurerm_monitor_action_group" "email_dso" {
      + enabled             = true
      + id                  = (known after apply)
      + name                = "email_dso"
      + resource_group_name = "nomis-bip-t1"
      + short_name          = "email_dso"

      + email_receiver {
          + email_address           = "william.gibbon@digital.justice.gov.uk"
          + name                    = "email_dso"
          + use_common_alert_schema = true
        }
    }

  # module.automation_account["nomis-bip-t1"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "nomis-bip-t1-automation-account"
      + target_resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account"

      + log {
          + category = "JobLogs"
          + enabled  = true
        }
      + log {
          + category = "JobStreams"
          + enabled  = true
        }
    }

  # module.automation_account["nomis-bip-t1"].azurerm_monitor_scheduled_query_rules_alert.alert will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {
      + data_source_id      = (known after apply)
      + description         = "Alert when errors exist in automation account job"
      + enabled             = true
      + frequency           = 30
      + id                  = (known after apply)
      + location            = "ukwest"
      + name                = "automation_account_query_rule"
      + query               = <<-EOT
            AzureDiagnostics 
            | where ResourceProvider == "MICROSOFT.AUTOMATION"
            | where StreamType_s == "Error"
            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription
        EOT
      + query_type          = "ResultCount"
      + resource_group_name = "nomis-bip-t1"
      + severity            = 0
      + time_window         = 30

      + action {
          + action_group           = (known after apply)
          + custom_webhook_payload = (known after apply)
          + email_subject          = "nomis-bip-t1-automation-account job errors"
        }

      + trigger {
          + operator  = "GreaterThan"
          + threshold = 0
        }
    }

  # module.automation_account["t1-oasys"].azurerm_automation_job_schedule.job_schedules["0"] will be created
  + resource "azurerm_automation_job_schedule" "job_schedules" {
      + automation_account_name = "t1-oasys-automation-account"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + resource_group_name     = "t1-oasys"
      + runbook_name            = "start-vms"
      + schedule_name           = "weekdays 6am"
    }

  # module.automation_account["t1-oasys"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
      ~ content                 = <<-EOT
            workflow start-vms
          - {
          + {   
                # vars
                $resourceGroup = "t1-oasys"
                $sequence_tag  = 'sequence_start'
                $delayBetweenGroups = "180"
                
                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation
                Connect-AzureRMAccount -Identity
            
                # get vm list
                $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup
                
                # remove exceptions from vm list by shutdown_exclude tag
                $vms_to_handle = InlineScript {
                    $vms_in_rg = $using:vms_in_rg
                    $vms_to_handle = [System.Collections.ArrayList]@()
                    foreach ($vm in $vms_in_rg) {
                        if ($vm.Tags.shutdown_exclude -ne 'true') {
                            $vms_to_handle += $vm
                        }
                    }
                    return $vms_to_handle
                }
                "vms to handle:"
                $vms_to_handle.Name
                ""
            
                # create ordering groups
                $ordered_vms = InlineScript {
                    $vms_to_handle = $using:vms_to_handle
                    $sequence_tag  = $using:sequence_tag
                    # add groups
                    $ordered_vms = [ordered]@{}
                    $ordered_vms['0'] = [System.Collections.ArrayList]@()
                    foreach ($vm in $vms_to_handle) {
                        if ($vm.Tags[$sequence_tag] -match '^\d+') {
                            $ordered_vms[$vm.Tags[$sequence_tag]] = [System.Collections.ArrayList]@()
                        }
                    }
                    # add vms into groups
                    foreach ($vm in $vms_to_handle) {
                        if ($vm.Tags[$sequence_tag] -match '^\d+') {
                            $ordered_vms[$vm.Tags[$sequence_tag]] += $vm.Name
                        } else {
                            $ordered_vms['0'] += $vm.Name
                        }
                    }
            
                    # sort groups
                    $ordered_vms = $ordered_vms.GetEnumerator() | sort -Property Key
                    return $ordered_vms
                }
                "sequence groups:"
                foreach ($group in $ordered_vms) {
                    $group.Name
                    foreach ($vm in $group.Value) { 
                        $vm
                    }
                    ""
                }
                
                # iterate over vms
                foreach ($group in $ordered_vms) {
                    # there is duplication because i wasted too much time trying to put -parallel as a variable and splatting in. Powershell problems...
                    # 'Splatting is not permitted in workflow activities or in calls to workflows'
                    if ($group.Key -match '_series$') {
                        foreach ($vm in $group.Value) { 
                            InlineScript {
                                $vm            = $Using:vm
                                $resourceGroup = $Using:resourceGroup
            
                                # start vm
                                Start-AzureRmVM -ResourceGroupName $resourceGroup -Name $vm
            
                                # update monitoring tag
                                $tags = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags
                                $tags.not_monitored = "false"
                                Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $tags -Force
                            } 
                        }
                    } else {
                        foreach -parallel ($vm in $group.Value) {
                            InlineScript {
                                $vm            = $Using:vm
                                $resourceGroup = $Using:resourceGroup
            
                                # start vm
                                Start-AzureRmVM -ResourceGroupName $resourceGroup -Name $vm
            
                                # update monitoring tag
                                $tags = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags
                                $tags.not_monitored = "false"
                                Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $tags -Force 
                            }              
                        }
                    }
                    # add delay between groups
                    Start-Sleep -Seconds $delayBetweenGroups
                }
            }
        EOT
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account/runbooks/start-vms"
        name                    = "start-vms"
        tags                    = {
            "application"      = "OASys"
            "environment_name" = "T1"
            "service"          = "OASys"
        }
        # (7 unchanged attributes hidden)
    }

  # module.automation_account["t1-oasys"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account/runbooks/stop-vms"
      ~ log_verbose             = true -> false
        name                    = "stop-vms"
        tags                    = {
            "application"      = "OASys"
            "environment_name" = "T1"
            "service"          = "OASys"
        }
        # (7 unchanged attributes hidden)
    }

  # module.automation_account["t1-oasys"].azurerm_log_analytics_workspace.analytics_workspace will be created
  + resource "azurerm_log_analytics_workspace" "analytics_workspace" {
      + daily_quota_gb             = -1
      + id                         = (known after apply)
      + internet_ingestion_enabled = true
      + internet_query_enabled     = true
      + location                   = "ukwest"
      + name                       = "t1-oasys-automation-account"
      + portal_url                 = (known after apply)
      + primary_shared_key         = (sensitive value)
      + resource_group_name        = "t1-oasys"
      + retention_in_days          = 30
      + secondary_shared_key       = (sensitive value)
      + sku                        = "PerGB2018"
      + tags                       = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        }
      + workspace_id               = (known after apply)
    }

  # module.automation_account["t1-oasys"].azurerm_monitor_action_group.email_dso will be created
  + resource "azurerm_monitor_action_group" "email_dso" {
      + enabled             = true
      + id                  = (known after apply)
      + name                = "email_dso"
      + resource_group_name = "t1-oasys"
      + short_name          = "email_dso"

      + email_receiver {
          + email_address           = "william.gibbon@digital.justice.gov.uk"
          + name                    = "email_dso"
          + use_common_alert_schema = true
        }
    }

  # module.automation_account["t1-oasys"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "t1-oasys-automation-account"
      + target_resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account"

      + log {
          + category = "JobLogs"
          + enabled  = true
        }
      + log {
          + category = "JobStreams"
          + enabled  = true
        }
    }

  # module.automation_account["t1-oasys"].azurerm_monitor_scheduled_query_rules_alert.alert will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {
      + data_source_id      = (known after apply)
      + description         = "Alert when errors exist in automation account job"
      + enabled             = true
      + frequency           = 30
      + id                  = (known after apply)
      + location            = "ukwest"
      + name                = "automation_account_query_rule"
      + query               = <<-EOT
            AzureDiagnostics 
            | where ResourceProvider == "MICROSOFT.AUTOMATION"
            | where StreamType_s == "Error"
            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription
        EOT
      + query_type          = "ResultCount"
      + resource_group_name = "t1-oasys"
      + severity            = 0
      + time_window         = 30

      + action {
          + action_group           = (known after apply)
          + custom_webhook_payload = (known after apply)
          + email_subject          = "t1-oasys-automation-account job errors"
        }

      + trigger {
          + operator  = "GreaterThan"
          + threshold = 0
        }
    }

  # module.automation_account["t1-prisonnomis"].azurerm_automation_job_schedule.job_schedules["1"] will be created
  + resource "azurerm_automation_job_schedule" "job_schedules" {
      + automation_account_name = "t1-prisonnomis-automation-account"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + resource_group_name     = "t1-prisonnomis"
      + runbook_name            = "stop-vms"
      + schedule_name           = "weekdays 7pm"
    }

  # module.automation_account["t1-prisonnomis"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.Automation/automationAccounts/t1-prisonnomis-automation-account/runbooks/start-vms"
      ~ log_verbose             = true -> false
        name                    = "start-vms"
        tags                    = {
            "application"      = "NOMIS"
            "environment_name" = "T1"
            "service"          = "NOMIS"
        }
        # (7 unchanged attributes hidden)
    }

  # module.automation_account["t1-prisonnomis"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.Automation/automationAccounts/t1-prisonnomis-automation-account/runbooks/stop-vms"
      ~ log_verbose             = true -> false
        name                    = "stop-vms"
        tags                    = {
            "application"      = "NOMIS"
            "environment_name" = "T1"
            "service"          = "NOMIS"
        }
        # (7 unchanged attributes hidden)
    }

  # module.automation_account["t1-prisonnomis"].azurerm_log_analytics_workspace.analytics_workspace will be created
  + resource "azurerm_log_analytics_workspace" "analytics_workspace" {
      + daily_quota_gb             = -1
      + id                         = (known after apply)
      + internet_ingestion_enabled = true
      + internet_query_enabled     = true
      + location                   = "ukwest"
      + name                       = "t1-prisonnomis-automation-account"
      + portal_url                 = (known after apply)
      + primary_shared_key         = (sensitive value)
      + resource_group_name        = "t1-prisonnomis"
      + retention_in_days          = 30
      + secondary_shared_key       = (sensitive value)
      + sku                        = "PerGB2018"
      + tags                       = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        }
      + workspace_id               = (known after apply)
    }

  # module.automation_account["t1-prisonnomis"].azurerm_monitor_action_group.email_dso will be created
  + resource "azurerm_monitor_action_group" "email_dso" {
      + enabled             = true
      + id                  = (known after apply)
      + name                = "email_dso"
      + resource_group_name = "t1-prisonnomis"
      + short_name          = "email_dso"

      + email_receiver {
          + email_address           = "william.gibbon@digital.justice.gov.uk"
          + name                    = "email_dso"
          + use_common_alert_schema = true
        }
    }

  # module.automation_account["t1-prisonnomis"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "t1-prisonnomis-automation-account"
      + target_resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.Automation/automationAccounts/t1-prisonnomis-automation-account"

      + log {
          + category = "JobLogs"
          + enabled  = true
        }
      + log {
          + category = "JobStreams"
          + enabled  = true
        }
    }

  # module.automation_account["t1-prisonnomis"].azurerm_monitor_scheduled_query_rules_alert.alert will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {
      + data_source_id      = (known after apply)
      + description         = "Alert when errors exist in automation account job"
      + enabled             = true
      + frequency           = 30
      + id                  = (known after apply)
      + location            = "ukwest"
      + name                = "automation_account_query_rule"
      + query               = <<-EOT
            AzureDiagnostics 
            | where ResourceProvider == "MICROSOFT.AUTOMATION"
            | where StreamType_s == "Error"
            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription
        EOT
      + query_type          = "ResultCount"
      + resource_group_name = "t1-prisonnomis"
      + severity            = 0
      + time_window         = 30

      + action {
          + action_group           = (known after apply)
          + custom_webhook_payload = (known after apply)
          + email_subject          = "t1-prisonnomis-automation-account job errors"
        }

      + trigger {
          + operator  = "GreaterThan"
          + threshold = 0
        }
    }

  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/runbooks/start-vms"
      ~ log_verbose             = true -> false
        name                    = "start-vms"
        tags                    = {
            "application"      = "OASys"
            "environment_name" = "T2"
            "service"          = "OASys"
        }
        # (7 unchanged attributes hidden)
    }

  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place
  ~ resource "azurerm_automation_runbook" "runbooks" {
        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/runbooks/stop-vms"
      ~ log_verbose             = true -> false
        name                    = "stop-vms"
        tags                    = {
            "application"      = "OASys"
            "environment_name" = "T2"
            "service"          = "OASys"
        }
        # (7 unchanged attributes hidden)
    }

  # module.automation_account["t2-oasys"].azurerm_log_analytics_workspace.analytics_workspace will be created
  + resource "azurerm_log_analytics_workspace" "analytics_workspace" {
      + daily_quota_gb             = -1
      + id                         = (known after apply)
      + internet_ingestion_enabled = true
      + internet_query_enabled     = true
      + location                   = "ukwest"
      + name                       = "t2-oasys-automation-account"
      + portal_url                 = (known after apply)
      + primary_shared_key         = (sensitive value)
      + resource_group_name        = "t2-oasys"
      + retention_in_days          = 30
      + secondary_shared_key       = (sensitive value)
      + sku                        = "PerGB2018"
      + tags                       = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        }
      + workspace_id               = (known after apply)
    }

  # module.automation_account["t2-oasys"].azurerm_monitor_action_group.email_dso will be created
  + resource "azurerm_monitor_action_group" "email_dso" {
      + enabled             = true
      + id                  = (known after apply)
      + name                = "email_dso"
      + resource_group_name = "t2-oasys"
      + short_name          = "email_dso"

      + email_receiver {
          + email_address           = "william.gibbon@digital.justice.gov.uk"
          + name                    = "email_dso"
          + use_common_alert_schema = true
        }
    }

  # module.automation_account["t2-oasys"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = (known after apply)
      + name                       = "t2-oasys-automation-account"
      + target_resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account"

      + log {
          + category = "JobLogs"
          + enabled  = true
        }
      + log {
          + category = "JobStreams"
          + enabled  = true
        }
    }

  # module.automation_account["t2-oasys"].azurerm_monitor_scheduled_query_rules_alert.alert will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {
      + data_source_id      = (known after apply)
      + description         = "Alert when errors exist in automation account job"
      + enabled             = true
      + frequency           = 30
      + id                  = (known after apply)
      + location            = "ukwest"
      + name                = "automation_account_query_rule"
      + query               = <<-EOT
            AzureDiagnostics 
            | where ResourceProvider == "MICROSOFT.AUTOMATION"
            | where StreamType_s == "Error"
            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription
        EOT
      + query_type          = "ResultCount"
      + resource_group_name = "t2-oasys"
      + severity            = 0
      + time_window         = 30

      + action {
          + action_group           = (known after apply)
          + custom_webhook_payload = (known after apply)
          + email_subject          = "t2-oasys-automation-account job errors"
        }

      + trigger {
          + operator  = "GreaterThan"
          + threshold = 0
        }
    }

Plan: 18 to add, 8 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account/runbooks/start-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "start-vms"%0A        tags                    = {%0A            "application"      = "BI"%0A            "environment_name" = "T1"%0A            "service"          = "NOMIS"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account/runbooks/stop-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "stop-vms"%0A        tags                    = {%0A            "application"      = "BI"%0A            "environment_name" = "T1"%0A            "service"          = "NOMIS"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_log_analytics_workspace.analytics_workspace will be created%0A  + resource "azurerm_log_analytics_workspace" "analytics_workspace" {%0A      + daily_quota_gb             = -1%0A      + id                         = (known after apply)%0A      + internet_ingestion_enabled = true%0A      + internet_query_enabled     = true%0A      + location                   = "ukwest"%0A      + name                       = "nomis-bip-t1-automation-account"%0A      + portal_url                 = (known after apply)%0A      + primary_shared_key         = (sensitive value)%0A      + resource_group_name        = "nomis-bip-t1"%0A      + retention_in_days          = 30%0A      + secondary_shared_key       = (sensitive value)%0A      + sku                        = "PerGB2018"%0A      + tags                       = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A      + workspace_id               = (known after apply)%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_monitor_action_group.email_dso will be created%0A  + resource "azurerm_monitor_action_group" "email_dso" {%0A      + enabled             = true%0A      + id                  = (known after apply)%0A      + name                = "email_dso"%0A      + resource_group_name = "nomis-bip-t1"%0A      + short_name          = "email_dso"%0A%0A      + email_receiver {%0A          + email_address           = "william.gibbon@digital.justice.gov.uk"%0A          + name                    = "email_dso"%0A          + use_common_alert_schema = true%0A        }%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be created%0A  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {%0A      + id                         = (known after apply)%0A      + log_analytics_workspace_id = (known after apply)%0A      + name                       = "nomis-bip-t1-automation-account"%0A      + target_resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account"%0A%0A      + log {%0A          + category = "JobLogs"%0A          + enabled  = true%0A        }%0A      + log {%0A          + category = "JobStreams"%0A          + enabled  = true%0A        }%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_monitor_scheduled_query_rules_alert.alert will be created%0A  + resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {%0A      + data_source_id      = (known after apply)%0A      + description         = "Alert when errors exist in automation account job"%0A      + enabled             = true%0A      + frequency           = 30%0A      + id                  = (known after apply)%0A      + location            = "ukwest"%0A      + name                = "automation_account_query_rule"%0A      + query               = <<-EOT%0A            AzureDiagnostics %0A            | where ResourceProvider == "MICROSOFT.AUTOMATION"%0A            | where StreamType_s == "Error"%0A            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription%0A        EOT%0A      + query_type          = "ResultCount"%0A      + resource_group_name = "nomis-bip-t1"%0A      + severity            = 0%0A      + time_window         = 30%0A%0A      + action {%0A          + action_group           = (known after apply)%0A          + custom_webhook_payload = (known after apply)%0A          + email_subject          = "nomis-bip-t1-automation-account job errors"%0A        }%0A%0A      + trigger {%0A          + operator  = "GreaterThan"%0A          + threshold = 0%0A        }%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_automation_job_schedule.job_schedules["0"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t1-oasys-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t1-oasys"%0A      + runbook_name            = "start-vms"%0A      + schedule_name           = "weekdays 6am"%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A      ~ content                 = <<-EOT%0A            workflow start-vms%0A          - {%0A          + {   %0A                # vars%0A                $resourceGroup = "t1-oasys"%0A                $sequence_tag  = 'sequence_start'%0A                $delayBetweenGroups = "180"%0A                %0A                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation%0A                Connect-AzureRMAccount -Identity%0A            %0A                # get vm list%0A                $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup%0A                %0A                # remove exceptions from vm list by shutdown_exclude tag%0A                $vms_to_handle = InlineScript {%0A                    $vms_in_rg = $using:vms_in_rg%0A                    $vms_to_handle = [System.Collections.ArrayList]@()%0A                    foreach ($vm in $vms_in_rg) {%0A                        if ($vm.Tags.shutdown_exclude -ne 'true') {%0A                            $vms_to_handle += $vm%0A                        }%0A                    }%0A                    return $vms_to_handle%0A                }%0A                "vms to handle:"%0A                $vms_to_handle.Name%0A                ""%0A            %0A                # create ordering groups%0A                $ordered_vms = InlineScript {%0A                    $vms_to_handle = $using:vms_to_handle%0A                    $sequence_tag  = $using:sequence_tag%0A                    # add groups%0A                    $ordered_vms = [ordered]@{}%0A                    $ordered_vms['0'] = [System.Collections.ArrayList]@()%0A                    foreach ($vm in $vms_to_handle) {%0A                        if ($vm.Tags[$sequence_tag] -match '^\d+') {%0A                            $ordered_vms[$vm.Tags[$sequence_tag]] = [System.Collections.ArrayList]@()%0A                        }%0A                    }%0A                    # add vms into groups%0A                    foreach ($vm in $vms_to_handle) {%0A                        if ($vm.Tags[$sequence_tag] -match '^\d+') {%0A                            $ordered_vms[$vm.Tags[$sequence_tag]] += $vm.Name%0A                        } else {%0A                            $ordered_vms['0'] += $vm.Name%0A                        }%0A                    }%0A            %0A                    # sort groups%0A                    $ordered_vms = $ordered_vms.GetEnumerator() | sort -Property Key%0A                    return $ordered_vms%0A                }%0A                "sequence groups:"%0A                foreach ($group in $ordered_vms) {%0A                    $group.Name%0A                    foreach ($vm in $group.Value) { %0A                        $vm%0A                    }%0A                    ""%0A                }%0A                %0A                # iterate over vms%0A                foreach ($group in $ordered_vms) {%0A                    # there is duplication because i wasted too much time trying to put -parallel as a variable and splatting in. Powershell problems...%0A                    # 'Splatting is not permitted in workflow activities or in calls to workflows'%0A                    if ($group.Key -match '_series$') {%0A                        foreach ($vm in $group.Value) { %0A                            InlineScript {%0A                                $vm            = $Using:vm%0A                                $resourceGroup = $Using:resourceGroup%0A            %0A                                # start vm%0A                                Start-AzureRmVM -ResourceGroupName $resourceGroup -Name $vm%0A            %0A                                # update monitoring tag%0A                                $tags = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags%0A                                $tags.not_monitored = "false"%0A                                Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $tags -Force%0A                            } %0A                        }%0A                    } else {%0A                        foreach -parallel ($vm in $group.Value) {%0A                            InlineScript {%0A                                $vm            = $Using:vm%0A                                $resourceGroup = $Using:resourceGroup%0A            %0A                                # start vm%0A                                Start-AzureRmVM -ResourceGroupName $resourceGroup -Name $vm%0A            %0A                                # update monitoring tag%0A                                $tags = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags%0A                                $tags.not_monitored = "false"%0A                                Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $tags -Force %0A                            }              %0A                        }%0A                    }%0A                    # add delay between groups%0A                    Start-Sleep -Seconds $delayBetweenGroups%0A                }%0A            }%0A        EOT%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account/runbooks/start-vms"%0A        name                    = "start-vms"%0A        tags                    = {%0A            "application"      = "OASys"%0A            "environment_name" = "T1"%0A            "service"          = "OASys"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account/runbooks/stop-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "stop-vms"%0A        tags                    = {%0A            "application"      = "OASys"%0A            "environment_name" = "T1"%0A            "service"          = "OASys"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_log_analytics_workspace.analytics_workspace will be created%0A  + resource "azurerm_log_analytics_workspace" "analytics_workspace" {%0A      + daily_quota_gb             = -1%0A      + id                         = (known after apply)%0A      + internet_ingestion_enabled = true%0A      + internet_query_enabled     = true%0A      + location                   = "ukwest"%0A      + name                       = "t1-oasys-automation-account"%0A      + portal_url                 = (known after apply)%0A      + primary_shared_key         = (sensitive value)%0A      + resource_group_name        = "t1-oasys"%0A      + retention_in_days          = 30%0A      + secondary_shared_key       = (sensitive value)%0A      + sku                        = "PerGB2018"%0A      + tags                       = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A      + workspace_id               = (known after apply)%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_monitor_action_group.email_dso will be created%0A  + resource "azurerm_monitor_action_group" "email_dso" {%0A      + enabled             = true%0A      + id                  = (known after apply)%0A      + name                = "email_dso"%0A      + resource_group_name = "t1-oasys"%0A      + short_name          = "email_dso"%0A%0A      + email_receiver {%0A          + email_address           = "william.gibbon@digital.justice.gov.uk"%0A          + name                    = "email_dso"%0A          + use_common_alert_schema = true%0A        }%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be created%0A  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {%0A      + id                         = (known after apply)%0A      + log_analytics_workspace_id = (known after apply)%0A      + name                       = "t1-oasys-automation-account"%0A      + target_resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account"%0A%0A      + log {%0A          + category = "JobLogs"%0A          + enabled  = true%0A        }%0A      + log {%0A          + category = "JobStreams"%0A          + enabled  = true%0A        }%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_monitor_scheduled_query_rules_alert.alert will be created%0A  + resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {%0A      + data_source_id      = (known after apply)%0A      + description         = "Alert when errors exist in automation account job"%0A      + enabled             = true%0A      + frequency           = 30%0A      + id                  = (known after apply)%0A      + location            = "ukwest"%0A      + name                = "automation_account_query_rule"%0A      + query               = <<-EOT%0A            AzureDiagnostics %0A            | where ResourceProvider == "MICROSOFT.AUTOMATION"%0A            | where StreamType_s == "Error"%0A            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription%0A        EOT%0A      + query_type          = "ResultCount"%0A      + resource_group_name = "t1-oasys"%0A      + severity            = 0%0A      + time_window         = 30%0A%0A      + action {%0A          + action_group           = (known after apply)%0A          + custom_webhook_payload = (known after apply)%0A          + email_subject          = "t1-oasys-automation-account job errors"%0A        }%0A%0A      + trigger {%0A          + operator  = "GreaterThan"%0A          + threshold = 0%0A        }%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_job_schedule.job_schedules["1"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t1-prisonnomis-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t1-prisonnomis"%0A      + runbook_name            = "stop-vms"%0A      + schedule_name           = "weekdays 7pm"%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.Automation/automationAccounts/t1-prisonnomis-automation-account/runbooks/start-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "start-vms"%0A        tags                    = {%0A            "application"      = "NOMIS"%0A            "environment_name" = "T1"%0A            "service"          = "NOMIS"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.Automation/automationAccounts/t1-prisonnomis-automation-account/runbooks/stop-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "stop-vms"%0A        tags                    = {%0A            "application"      = "NOMIS"%0A            "environment_name" = "T1"%0A            "service"          = "NOMIS"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_log_analytics_workspace.analytics_workspace will be created%0A  + resource "azurerm_log_analytics_workspace" "analytics_workspace" {%0A      + daily_quota_gb             = -1%0A      + id                         = (known after apply)%0A      + internet_ingestion_enabled = true%0A      + internet_query_enabled     = true%0A      + location                   = "ukwest"%0A      + name                       = "t1-prisonnomis-automation-account"%0A      + portal_url                 = (known after apply)%0A      + primary_shared_key         = (sensitive value)%0A      + resource_group_name        = "t1-prisonnomis"%0A      + retention_in_days          = 30%0A      + secondary_shared_key       = (sensitive value)%0A      + sku                        = "PerGB2018"%0A      + tags                       = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A      + workspace_id               = (known after apply)%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_monitor_action_group.email_dso will be created%0A  + resource "azurerm_monitor_action_group" "email_dso" {%0A      + enabled             = true%0A      + id                  = (known after apply)%0A      + name                = "email_dso"%0A      + resource_group_name = "t1-prisonnomis"%0A      + short_name          = "email_dso"%0A%0A      + email_receiver {%0A          + email_address           = "william.gibbon@digital.justice.gov.uk"%0A          + name                    = "email_dso"%0A          + use_common_alert_schema = true%0A        }%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be created%0A  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {%0A      + id                         = (known after apply)%0A      + log_analytics_workspace_id = (known after apply)%0A      + name                       = "t1-prisonnomis-automation-account"%0A      + target_resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-prisonnomis/providers/Microsoft.Automation/automationAccounts/t1-prisonnomis-automation-account"%0A%0A      + log {%0A          + category = "JobLogs"%0A          + enabled  = true%0A        }%0A      + log {%0A          + category = "JobStreams"%0A          + enabled  = true%0A        }%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_monitor_scheduled_query_rules_alert.alert will be created%0A  + resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {%0A      + data_source_id      = (known after apply)%0A      + description         = "Alert when errors exist in automation account job"%0A      + enabled             = true%0A      + frequency           = 30%0A      + id                  = (known after apply)%0A      + location            = "ukwest"%0A      + name                = "automation_account_query_rule"%0A      + query               = <<-EOT%0A            AzureDiagnostics %0A            | where ResourceProvider == "MICROSOFT.AUTOMATION"%0A            | where StreamType_s == "Error"%0A            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription%0A        EOT%0A      + query_type          = "ResultCount"%0A      + resource_group_name = "t1-prisonnomis"%0A      + severity            = 0%0A      + time_window         = 30%0A%0A      + action {%0A          + action_group           = (known after apply)%0A          + custom_webhook_payload = (known after apply)%0A          + email_subject          = "t1-prisonnomis-automation-account job errors"%0A        }%0A%0A      + trigger {%0A          + operator  = "GreaterThan"%0A          + threshold = 0%0A        }%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/runbooks/start-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "start-vms"%0A        tags                    = {%0A            "application"      = "OASys"%0A            "environment_name" = "T2"%0A            "service"          = "OASys"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account/runbooks/stop-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "stop-vms"%0A        tags                    = {%0A            "application"      = "OASys"%0A            "environment_name" = "T2"%0A            "service"          = "OASys"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_log_analytics_workspace.analytics_workspace will be created%0A  + resource "azurerm_log_analytics_workspace" "analytics_workspace" {%0A      + daily_quota_gb             = -1%0A      + id                         = (known after apply)%0A      + internet_ingestion_enabled = true%0A      + internet_query_enabled     = true%0A      + location                   = "ukwest"%0A      + name                       = "t2-oasys-automation-account"%0A      + portal_url                 = (known after apply)%0A      + primary_shared_key         = (sensitive value)%0A      + resource_group_name        = "t2-oasys"%0A      + retention_in_days          = 30%0A      + secondary_shared_key       = (sensitive value)%0A      + sku                        = "PerGB2018"%0A      + tags                       = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A      + workspace_id               = (known after apply)%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_monitor_action_group.email_dso will be created%0A  + resource "azurerm_monitor_action_group" "email_dso" {%0A      + enabled             = true%0A      + id                  = (known after apply)%0A      + name                = "email_dso"%0A      + resource_group_name = "t2-oasys"%0A      + short_name          = "email_dso"%0A%0A      + email_receiver {%0A          + email_address           = "william.gibbon@digital.justice.gov.uk"%0A          + name                    = "email_dso"%0A          + use_common_alert_schema = true%0A        }%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be created%0A  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {%0A      + id                         = (known after apply)%0A      + log_analytics_workspace_id = (known after apply)%0A      + name                       = "t2-oasys-automation-account"%0A      + target_resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account"%0A%0A      + log {%0A          + category = "JobLogs"%0A          + enabled  = true%0A        }%0A      + log {%0A          + category = "JobStreams"%0A          + enabled  = true%0A        }%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_monitor_scheduled_query_rules_alert.alert will be created%0A  + resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {%0A      + data_source_id      = (known after apply)%0A      + description         = "Alert when errors exist in automation account job"%0A      + enabled             = true%0A      + frequency           = 30%0A      + id                  = (known after apply)%0A      + location            = "ukwest"%0A      + name                = "automation_account_query_rule"%0A      + query               = <<-EOT%0A            AzureDiagnostics %0A            | where ResourceProvider == "MICROSOFT.AUTOMATION"%0A            | where StreamType_s == "Error"%0A            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription%0A        EOT%0A      + query_type          = "ResultCount"%0A      + resource_group_name = "t2-oasys"%0A      + severity            = 0%0A      + time_window         = 30%0A%0A      + action {%0A          + action_group           = (known after apply)%0A          + custom_webhook_payload = (known after apply)%0A          + email_subject          = "t2-oasys-automation-account job errors"%0A        }%0A%0A      + trigger {%0A          + operator  = "GreaterThan"%0A          + threshold = 0%0A        }%0A    }%0A%0APlan: 18 to add, 8 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account/runbooks/start-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "start-vms"%0A        tags                    = {%0A            "application"      = "BI"%0A            "environment_name" = "T1"%0A            "service"          = "NOMIS"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_automation_runbook.runbooks["stop-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A        id                      = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account/runbooks/stop-vms"%0A      ~ log_verbose             = true -> false%0A        name                    = "stop-vms"%0A        tags                    = {%0A            "application"      = "BI"%0A            "environment_name" = "T1"%0A            "service"          = "NOMIS"%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_log_analytics_workspace.analytics_workspace will be created%0A  + resource "azurerm_log_analytics_workspace" "analytics_workspace" {%0A      + daily_quota_gb             = -1%0A      + id                         = (known after apply)%0A      + internet_ingestion_enabled = true%0A      + internet_query_enabled     = true%0A      + location                   = "ukwest"%0A      + name                       = "nomis-bip-t1-automation-account"%0A      + portal_url                 = (known after apply)%0A      + primary_shared_key         = (sensitive value)%0A      + resource_group_name        = "nomis-bip-t1"%0A      + retention_in_days          = 30%0A      + secondary_shared_key       = (sensitive value)%0A      + sku                        = "PerGB2018"%0A      + tags                       = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A      + workspace_id               = (known after apply)%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_monitor_action_group.email_dso will be created%0A  + resource "azurerm_monitor_action_group" "email_dso" {%0A      + enabled             = true%0A      + id                  = (known after apply)%0A      + name                = "email_dso"%0A      + resource_group_name = "nomis-bip-t1"%0A      + short_name          = "email_dso"%0A%0A      + email_receiver {%0A          + email_address           = "william.gibbon@digital.justice.gov.uk"%0A          + name                    = "email_dso"%0A          + use_common_alert_schema = true%0A        }%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_monitor_diagnostic_setting.diagnostic_settings will be created%0A  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {%0A      + id                         = (known after apply)%0A      + log_analytics_workspace_id = (known after apply)%0A      + name                       = "nomis-bip-t1-automation-account"%0A      + target_resource_id         = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account"%0A%0A      + log {%0A          + category = "JobLogs"%0A          + enabled  = true%0A        }%0A      + log {%0A          + category = "JobStreams"%0A          + enabled  = true%0A        }%0A    }%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_monitor_scheduled_query_rules_alert.alert will be created%0A  + resource "azurerm_monitor_scheduled_query_rules_alert" "alert" {%0A      + data_source_id      = (known after apply)%0A      + description         = "Alert when errors exist in automation account job"%0A      + enabled             = true%0A      + frequency           = 30%0A      + id                  = (known after apply)%0A      + location            = "ukwest"%0A      + name                = "automation_account_query_rule"%0A      + query               = <<-EOT%0A            AzureDiagnostics %0A            | where ResourceProvider == "MICROSOFT.AUTOMATION"%0A            | where StreamType_s == "Error"%0A            | project TimeGenerated, JobId_g, RunbookName_s, _ResourceId, Resource, ResultDescription%0A        EOT%0A      + query_type          = "ResultCount"%0A      + resource_group_name = "nomis-bip-t1"%0A      + severity            = 0%0A      + time_window         = 30%0A%0A      + action {%0A          + action_group           = (known after apply)%0A          + custom_webhook_payload = (known after apply)%0A          + email_subject          = "nomis-bip-t1-automation-account job errors"%0A        }%0A%0A      + trigger {%0A          + operator  = "GreaterThan"%0A          + threshold = 0%0A        }%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_automation_job_schedule.job_schedules["0"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t1-oasys-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t1-oasys"%0A      + runbook_name            = "start-vms"%0A      + schedule_name           = "weekdays 6am"%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_automation_runbook.runbooks["start-vms"] will be updated in-place%0A  ~ resource "azurerm_automation_runbook" "runbooks" {%0A      ~ content                 = <<-EOT%0A            workflow start-vms%0A          - {%0A          + {   %0A                # vars%0A                $resourceGroup = "t1-oasys"%0A                $sequence_tag  = 'sequence_start'%0A                $delayBetweenGroups = "180"%0A                %0A                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation%0A                Connect-AzureRMAccount -Identity%0A            %0A                # get vm list%0A                $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup%0A                %0A                # remove exceptions from vm list by shutdown_exclude tag%0A                $vms_to_handle = InlineScript {%0A                    $vms_in_rg = $using:vms_in_rg%0A                    $vms_to_handle = [System.Collections.ArrayList]@()%0A                    foreach ($vm in $vms_in_rg) {%0A                        if ($vm.Tags.shutdown_exclude -ne 'true') {%0A                            $vms_to_handle += $vm%0A                        }%0A                    }%0A                    return $vms_to_handle%0A                }%0A                "vms to handle:"%0A                $vms_to_handle.Name%0A                ""%0A            %0A                # create ordering groups%0A                $ordered_vms = InlineScript {%0A                    $vms_to_handle = $using:vms_to_handle%0A                    $sequence_tag  = $using:sequence_tag%0A                    # add groups%0A                    $ordered_vms = [ordered]@{}%0A                    $ordered_vms['0'] = [System.Collections.ArrayList]@()%0A                    foreach ($vm in $vms_to_handle) {%0A                        if ($vm.Tags[$sequence_tag] -match '^\d+') {%0A                            $ordered_vms[$vm.Tags[$sequence_tag]] = [System.Collections.ArrayList]@()%0A                        }%0A                    }%0A                    # add vms into groups%0A                    foreach ($vm in $vms_to_handle) {%0A                        if ($vm.Tags[$sequence_tag] -match '^\d+') {%0A                            $ordered_vms[$vm.Tags[$sequence_tag]] += $vm.Name%0A                        } else {%0A                            $ordered_vms['0'] += $vm.Name%0A                        }%0A                    }%0A            %0A                    # sort groups%0A                    $ordered_vms = $ordered_vms.GetEnumerator() | sort -Property Key%0A                    return $ordered_vms%0A                }%0A                "sequence groups:"%0A                foreach ($group in $ordered_vms) {%0A                    $group.Name%0A                    foreach ($vm in $group.Value) { %0A                        $vm%0A                    }%0A                    ""%0A                }%0A                %0A                # iterate over vms%0A                foreach ($group in $ordered_vms) {%0A                    # there is duplication because i wasted too much time trying to put -parallel as a variable and splatting in. Powershell problems...%0A                    # 'Splatting is not permitted in workflow activities or in calls to workflows'%0A                    if ($group.Key -match '_series$') {%0A                        foreach ($vm in $group.Value) { %0A                            InlineScript {%0A                                $vm            = $Using:vm%0A                                $resourceGroup = $Using:resourceGroup%0A            %0A                                # start vm%0A                                Start-AzureRmVM -ResourceGroupName $resourceGroup -Name $vm%0A            %0A                  ```